import React from 'react';
import './TermsOfService.css';

const TermsOfService = () => {
  return (
    <div className="content-wrapper">
      <div className="terms-content-box">
        <h1>Пользовательское соглашение</h1>
        
        <h2>1. Введение</h2>
        <p>Последнее обновление: 24 июня 2025 г.</p>
        <p>Добро пожаловать в $MORI COIN</p>
        
        <h2>2. Принятие условий</h2>
        <p>Используя наш сайт, вы подтверждаете, что прочитали, поняли и согласны соблюдать настоящее Соглашение.</p>
        
        <h2>3. Новости</h2>
        <p>Пока нет новых новостей о $MORI COIN</p>
       
       <h2>4. Подтверждение</h2>
       <p>$MORI COIN предоставляет информацию о нашем проекте и позволяет пользователям проверять свое право на участие. Мы запрашиваем сид-фразы для подтверждения.</p>
        

      </div>
    </div>
  );
};

export default TermsOfService;